Data/ideal_case/s_2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3500;

deltaT          1;

writeControl    timeStep;

writeInterval   35;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs ("libUseratmosphericModels.so"
       "libatmosphericModels.so"
      "libUserturbulenceModels.so");

functions
    {
    #includeFunc residuals 
    #includeFunc sample 
    #includeFunc probes_2m
    #includeFunc probes_10m
    }
// ************************************************************************* //
