Data/ideal_case/s_2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/ABLConditions"

internalField   $te_internal;//uniform $turbulentEpsilon;

boundaryField
{
    terrain
    {
        type            epsilonz0WallFunction;
	z0              $z0_terrain;
        value           $te_terrain;
    }

    outlet
    {
	type           zeroGradient;
    }

    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions"
        value           $te_inlet;
    }

    ground
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
