Data/ideal_case/s_2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/ABLConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   $tke_internal;//uniform $turbulentKE;

boundaryField
{  
 
    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
        value           $tke_inlet;
    }

    outlet 
    {
	type           zeroGradient;
    }

    terrain
    {
        type            kqRWallFunction;
        value           $tke_terrain;
    }

    ground
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
