Data/ideal_case/s_2/system/probes_10m
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U epsilon k);

interpolationScheme cell;

probeLocations
(
    (121.125 217.5 940) //Probe 1
    (121.125 652.5 940) //Probe 2
    (363.375 435 940)   //Probe 3
    (605.625 435 940)   //Probe 4
    (847.875 435 940)   //Probe 5
    (363.375 217.5 940)
    (363.375 652.5 940) 
    (605.625 217.5 940)
    (605.625 652.5 940)
    (847.875 217.5 940)
    (847.875 652.5 940)
);

// ************************************************************************* //
